#+TITLE: Base de datos
#+AUTHOR: fran
#+LANGUAGE: es
#+STARTUP: content indent showeverything
#+PROPERTY: header-args:sql :engine mysql :dbhost localhost :dbuser root :dbpassword root :database Autenticacion

* SQL

#+name: my-query
#+begin_src sql
    SELECT u.id, u.usuario, u.email, u.nombre, u.telefono, u.direccion,
        (
            SELECT JSON_ARRAYAGG(JSON_OBJECT('id', p.id, 'nombre', p.nombre))
            FROM UsuarioPermiso up
            JOIN Permiso p ON up.permiso_id = p.id
            WHERE up.usuario_id = u.id
        ) AS permisos,    
        (
            SELECT JSON_ARRAYAGG(
                JSON_OBJECT(
                    'id', r.id,
                    'nombre', r.nombre,
                    'permisos', (
                        SELECT JSON_ARRAYAGG(JSON_OBJECT('id', p2.id, 'nombre', p2.nombre))
                        FROM RolPermiso rp
                        JOIN Permiso p2 ON rp.permiso_id = p2.id
                        WHERE rp.rol_id = r.id
                    )
                )
            )
            FROM UsuarioRol ur
            JOIN Rol r ON ur.rol_id = r.id
            WHERE ur.usuario_id = u.id
        ) AS roles
    FROM Usuario u GROUP BY u.id;
#+end_src

#+RESULTS: my-query
| id | usuario | email           | nombre | telefono | direccion | permisos_directos | roles                                                                                                                                                                                                |
|----+---------+-----------------+--------+----------+-----------+-------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
|  1 | fran    | fran1@gmail.com | NULL   | NULL     | NULL      | NULL              | [{"id": 1, "nombre": "ADMIN", "permisos": [{"id": 1, "nombre": "USUARIO_ALTA"},{"id": 2, "nombre": "USUARIO_BAJA"},{"id": 3, "nombre": "USUARIO_LISTAR"},{"id": 4, "nombre": "USUARIO_MODIFICAR"}]}] |
|  2 | fran2   | fran2@gmail.com | NULL   | NULL     | NULL      | NULL              | [{"id": 2, "nombre": "EMPLEADO", "permisos": [{"id": 3, "nombre": "USUARIO_LISTAR"}]}]                                                                                                               |
|  3 | fran3   | fran3@gmail.com | NULL   | NULL     | NULL      | NULL              | [{"id": 3, "nombre": "USUARIO", "permisos": null}]                                                                                                                                                   |
